app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Nba"], ["description", "Go Bulls"], ["created_at", "2020-09-06 21:46:55.090636"], ["updated_at", "2020-09-06 21:46:55.090636"]]
---
	def create
	  @post = Post.new(post_params)
	  @post.save